nsspost/promicro-nrf52840-watch/src/platform/ble_softdevice.c
#include "watch/ble.h"

#include <stddef.h>
#include <stdint.h>

#include "ble.h"
#include "ble_gap.h"
#include "ble_gatt.h"
#include "ble_gatts.h"
#include "nrf_error.h"
#include "nrf_sdm.h"
#include "watch/clock.h"
#include "watch/tseho_link.h"

#define WATCH_BLE_RAM_START       0x20004000u
#define WATCH_BLE_EVENT_BUFFER    256u
#define WATCH_BLE_CONN_TAG        1u
#define WATCH_BLE_VALUE_MAX_LEN   20u

#define WATCH_LINK_SERVICE_UUID   0x0001u
#define WATCH_LINK_RX_UUID        0x0002u
#define WATCH_LINK_TX_UUID        0x0003u
#define WATCH_ARTWORK_WIDTH        80u
#define WATCH_ARTWORK_HEIGHT       80u
#define WATCH_ARTWORK_BYTES        (WATCH_ARTWORK_WIDTH * WATCH_ARTWORK_HEIGHT * 2u)

static const uint8_t watch_device_name[] = "Tseho Watch";
static const ble_uuid128_t watch_link_base_uuid = {
    .uuid128 = {
        0x2E, 0x73, 0xB5, 0xF0, 0x91, 0x6C, 0xD1, 0xA2,
        0x8B, 0x4E, 0xF7, 0x34, 0x00, 0x00, 0x5C, 0x7A
    }
};

static uint8_t watch_adv_data[] = {
    2u, BLE_GAP_AD_TYPE_FLAGS,
    BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE,
    sizeof(watch_device_name), BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME,
    'T', 's', 'e', 'h', 'o', ' ', 'W', 'a', 't', 'c', 'h'
};

static uint8_t watch_scan_response[] = {
    17u, BLE_GAP_AD_TYPE_128BIT_SERVICE_UUID_COMPLETE,
    0x2E, 0x73, 0xB5, 0xF0, 0x91, 0x6C, 0xD1, 0xA2,
    0x8B, 0x4E, 0xF7, 0x34, 0x01, 0x00, 0x5C, 0x7A
};

static __attribute__((aligned(4))) uint8_t watch_ble_event[WATCH_BLE_EVENT_BUFFER];
static watch_ble_status_t watch_ble_status;
static watch_ble_media_status_t watch_ble_media = {
    .volume = 0xFFu, .shuffle = 0xFFu, .repeat = 0xFFu
};
static watch_ble_notifications_t watch_ble_notifications;
static uint8_t watch_artwork_pixels[WATCH_ARTWORK_BYTES];
static watch_ble_artwork_status_t watch_ble_artwork = {
    .pixels = watch_artwork_pixels,
    .width = WATCH_ARTWORK_WIDTH,
    .height = WATCH_ARTWORK_HEIGHT
};
static uint16_t watch_artwork_expected_bytes;
static uint16_t watch_artwork_received_bytes;
static ble_gatts_char_handles_t watch_link_rx_handles;
static ble_gatts_char_handles_t watch_link_tx_handles;
static uint16_t watch_conn_handle = BLE_CONN_HANDLE_INVALID;
static uint8_t watch_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;
static uint8_t watch_link_uuid_type;
static bool watch_tx_subscribed;
static bool watch_hello_pending;
static uint16_t watch_link_tx_sequence;
static tseho_link_parser_t watch_link_parser;

static void watch_softdevice_fault(uint32_t id, uint32_t pc, uint32_t info)
{
    watch_ble_status.state = WATCH_BLE_STATE_ERROR;
    watch_ble_status.error = 0xF0000000u | (id & 0xFFFFu);
    watch_ble_status.last_packet_header = pc ^ info;
    for (;;) {
        __asm volatile ("wfi");
    }
}

static bool watch_ble_check(uint32_t result, uint32_t step)
{
    if (result == NRF_SUCCESS) {
        return true;
    }
    watch_ble_status.state = WATCH_BLE_STATE_ERROR;
    watch_ble_status.error = (step << 24) | (result & 0x00FFFFFFu);
    return false;
}

static void watch_open_security(ble_gap_conn_sec_mode_t *mode)
{
    mode->sm = 1u;
    mode->lv = 1u;
}

static bool watch_link_add_characteristic(uint16_t service_handle,
                                          uint16_t uuid_value,
                                          bool rx,
                                          ble_gatts_char_handles_t *handles)
{
    uint8_t initial_value = 0u;
    ble_uuid_t uuid = {
        .uuid = uuid_value,
        .type = watch_link_uuid_type
    };
    ble_gatts_attr_md_t value_md = {0};
    ble_gatts_attr_t value_attr = {0};
    ble_gatts_char_md_t char_md = {0};
    ble_gatts_attr_md_t cccd_md = {0};

    if (rx) {
        watch_open_security(&value_md.read_perm);
        watch_open_security(&value_md.write_perm);
    }
    value_md.vloc = BLE_GATTS_VLOC_STACK;
    value_md.vlen = 1u;

    value_attr.p_uuid = &uuid;
    value_attr.p_attr_md = &value_md;
    value_attr.init_len = 1u;
    value_attr.max_len = WATCH_BLE_VALUE_MAX_LEN;
    value_attr.p_value = &initial_value;

    if (rx) {
        char_md.char_props.write = 1u;
        char_md.char_props.write_wo_resp = 1u;
    } else {
        char_md.char_props.notify = 1u;
        watch_open_security(&cccd_md.read_perm);
        watch_open_security(&cccd_md.write_perm);
        cccd_md.vloc = BLE_GATTS_VLOC_STACK;
        char_md.p_cccd_md = &cccd_md;
    }

    return watch_ble_check(
        sd_ble_gatts_characteristic_add(service_handle,
                                        &char_md,
                                        &value_attr,
                                        handles),
        rx ? 7u : 8u);
}

static bool watch_link_init(void)
{
    ble_uuid_t service_uuid = {0};
    uint16_t service_handle;

    if (!watch_ble_check(sd_ble_uuid_vs_add(&watch_link_base_uuid,
                                            &watch_link_uuid_type), 5u)) {
        return false;
    }
    service_uuid.type = watch_link_uuid_type;
    service_uuid.uuid = WATCH_LINK_SERVICE_UUID;
    if (!watch_ble_check(
            sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY,
                                     &service_uuid,
                                     &service_handle),
            6u)) {
        return false;
    }
    if (!watch_link_add_characteristic(service_handle,
                                       WATCH_LINK_RX_UUID, true,
                                       &watch_link_rx_handles)) {
        return false;
    }
    return watch_link_add_characteristic(service_handle,
                                         WATCH_LINK_TX_UUID, false,
                                         &watch_link_tx_handles);
}

static bool watch_link_notify(uint8_t type,
                              uint8_t flags,
                              const uint8_t *payload,
                              uint16_t payload_length)
{
    uint8_t frame[WATCH_BLE_VALUE_MAX_LEN];
    size_t frame_length = 0u;
    uint16_t hvx_length;
    ble_gatts_hvx_params_t params = {0};

    if (!watch_tx_subscribed ||
        (watch_conn_handle == BLE_CONN_HANDLE_INVALID)) {
        return false;
    }
    if (tseho_link_encode(type, flags, watch_link_tx_sequence,
                          payload, payload_length,
                          frame, sizeof(frame), &frame_length) !=
        TSEHO_LINK_ENCODE_OK) {
        return false;
    }

    hvx_length = (uint16_t)frame_length;
    params.handle = watch_link_tx_handles.value_handle;
    params.type = BLE_GATT_HVX_NOTIFICATION;
    params.offset = 0u;
    params.p_len = &hvx_length;
    params.p_data = frame;
    uint32_t result = sd_ble_gatts_hvx(watch_conn_handle, &params);
    if (result == NRF_SUCCESS) {
        watch_link_tx_sequence++;
        watch_ble_status.tx_notifications++;
        return true;
    }
    if (result != NRF_ERROR_RESOURCES) {
        watch_ble_status.error = (17u << 24) | result;
    }
    return false;
}

